mattbutlerengineering/esp32-2.16/launcher/sdkconfig.defaults
# Defaults for the Orb Launcher on ESP32-S3R8 (8MB octal PSRAM, 16MB flash).
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Octal PSRAM (R8) — LVGL framebuffer lives here
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Reasonable defaults
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
